УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/смартПравилаДанныхКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаДанныхКонструктора</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НазначениеДанных</name>
    <type>
      <types>CatalogRef.смартНазначениеДанныхКонструктора</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НомерПоПорядку = 0 Тогда
		НомерПоПорядку = Справочники.смартПравилаДанныхКонструктора.ПолучитьПоследнийНомерПоПорядку(НазначениеДанных, ВидОборудования) + 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерПоПорядку = 0;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
